<?php defined('SYSPATH') or die('No direct script access.');


/**
 * Тип удостоверения личности в подсистеме GDS
 *
 * @author V.Skorykh
 * @since 02.02.2016 12:43
 */
class Gate_Gds_DocType
{

	/**
	 * Паспорт гражданина РФ, код типа документа по стандарту Минтранса
	 */
	const TYPE_PASSPORT_RUS = "0";

	/**
	 * Загранпаспорт гражданина РФ, код типа документа по стандарту Минтранса
	 */
	const TYPE_PASSPORT_INTERNATIONAL = "2";

	/**
	 * Св-во о рождении гражданина РФ, код типа документа по стандарту Минтранса
	 */
	const TYPE_BIRTH_CERT = "4";

	/**
	 * Паспорт иностранного гражданина, код типа документа по стандарту Минтранса
	 */
	const TYPE_PASSPORT_FOREIGN = "3";

	/**
	 * Удостоверение личности военнослужащего, код типа документа по стандарту Минтранса
	 */
	const TYPE_SERVICEMAN_ID = "5";

	/**
	 * Временное удостоверение личности, код типа документа по стандарту Минтранса
	 */
	const TYPE_TEMPORARY_ID_CARD = "7";

	/**
	 * Военный билет, код типа документа по стандарту Минтранса
	 */
	const TYPE_MILITARY_ID = "8";

	/**
	 * Вид на жительство, код типа документа по стандарту Минтранса
	 */
	const TYPE_RESIDENCE = "9";

	/**
	 * Справка об утере паспорта, код типа документа по стандарту Минтранса
	 */
	const TYPE_CERT_LOSS = "15";

	/**
	 * @var string Код типа документа по стандарту автовокзала
	 */
	public $code;

	/**
	 * @var string Название типа документа
	 */
	public $name;

	/**
	 * @var string Код типа документа по стандарту ЗащитаИнфоТранс
	 *
	 * @since 1.10
	 */
	public $type;
}